app/controllers/dashboard_controller.rb

SELECT  time(avg(time(strftime('%s',login_time)))) as average_time FROM "timelogs"  ORDER BY "timelogs"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "timelogs" WHERE (DATE(created_at) = '2016-11-20')
---
  def index
    @no_of_late_users = Timelog.nos_of_late_users_today
    @timelogs = Timelog.paginate(:page => params[:page], :per_page => 10)