app/controllers/dashboard_controller.rb

SELECT  *, users.name as username, avg(login_time) as avg_login_time FROM "timelogs" INNER JOIN "users" ON "users"."id" = "timelogs"."user_id"  ORDER BY users.name asc, login_time desc, avg_login_time desc LIMIT 10 OFFSET 10
SELECT COUNT(*) FROM "timelogs" INNER JOIN "users" ON "users"."id" = "timelogs"."user_id"
---
  def index
    @stats = Timelog.stats
    @timelogs = Timelog.joins(:user).select("*, users.name as username").paginate(:page => params[:page], :per_page => 10).order("users.name asc, login_time desc")

SELECT  time(avg(time(strftime('%s',login_time)))) as average_time FROM "timelogs" WHERE "timelogs"."user_id" = ?  ORDER BY "timelogs"."id" ASC LIMIT 1  [["user_id", 9]]
SELECT count(*) as y, is_late FROM "timelogs" WHERE "timelogs"."user_id" = ?  [["user_id", 20]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 9]]
---
  def user
    @stats = Timelog.user_stats(params[:id])
    @timelogs = Timelog.where(user_id: params[:id]).paginate(:page => params[:page], :per_page => 10)
    @user = User.find(params[:id])