app/controllers/timelogs_controller.rb

  def create
    @timelog = @user.timelogs.build(timelog_params)
    respond_to do |format|
      if @timelog.save
---
INSERT INTO "timelogs" ("user_id", "is_late", "login_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 17], ["is_late", "t"], ["login_time", "2016-11-20 11:47:58.060827"], ["created_at", "2016-11-20 11:47:58.061039"], ["updated_at", "2016-11-20 11:47:58.061039"]]

    def set_timelog
      @timelog = Timelog.find(params[:id])
---
SELECT  "timelogs".* FROM "timelogs" WHERE "timelogs"."id" = ? LIMIT 1  [["id", 1]]

    def find_user
      @user = User.find_by_name(params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "af"]]