app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "afzal1"], ["created_at", "2016-11-19 15:29:17.379145"], ["updated_at", "2016-11-19 15:29:17.379145"]]
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 7]]
---
  def destroy
    @user = User.find_by(id:params[:format])
    if @user.destroy